
/**Задача 2
 Реализовать программу определения вхождения точки в разнообразные геометрические фигуры. А также работы с фигурами.
    1.Предусмотреть возможность создания и хранения информации о окружностях, треугольниках,  прямоугольниках
    2.Реализовать функционал определения вхождения указанной точки на плоскости в указанную  фигуру.
    3.Реализовать функционал  работы с треугольниками:
        Определения типа треугольника: равнобедренный,  прямоугольный, тупоугольный
        *Реализовать функционал  определения подобия двух треугольников (являются подобными – не являются)
 * @autor Самойленко Виктор
 * @version 1.0
 */
public class Main {
    public static void main(String[] args) {

    }
}
